data = {
    "male": [
        "Артем", "Александр", "Михаил", "Мухаммад", "Амир", "Давид", "Максим", "Алдар", "Лев", "Матвей", "Роман",
        "Даниил", "Иван", "Кирилл", "Егор", "Алексей", "Дмитрий", "Евгений", "Денис", "Антон", "Игорь", "Павел",
        "Юрий", "Олег", "Вячеслав", "Василий", "Станислав", "Вадим", "Марк", "Мирон", "Тимофей", "Илья", "Данил",
        "Эренчин", "Амир", "Ярослав", "Константин", "Никита", "Сергей", "Бахтияр", "Адил", "Ананды", "Виктор",
        "Макар", "Асан", "Захар", "Арсений", "Николай", "Андрей", "Рахат", "Тимур", "Самир", "Канат", "Даян",
        "Владислав", "Геннадий", "Данила", "Вениамин", "Ренат", "Эдуард", "Игнат", "Артемий", "Владимир", "Савелий",
        "Рунат", "Давлат", "Семён", "Анатолий", "Валерий", "Аркадий", "Арман", "Рустам", "Данияр", "Сагдат", "Глеб",
        "Елисей", "Дамир", "Леонид", "Дияз", "Всеволод", "Руслан", "Жанарбек", "Андраник", "Роберт", "Святослав",
        "Куан", "Гарик", "Калижан", "Пётр", "Виталий", "Богдан", "Рахим", "Асхат", "Равиль", "Олжас", "Жаслан",
        "Степан", "Тлеген", "Федор", "Артур", "Адиль", "Корней", "Сурен", "Саидахрор", "Назар"
    ],
    "female": [
        "София", "Ева", "Амина", "Виктория", "Аиша", "Алия", "Анна", "Дарина", "Екатерина", "Марьям", "Милана",
        "Хадиджа", "Ханифа", "Елена", "Аврора", "Анастасия", "Дарья", "Александра", "Елизавета", "Алиса", "Наталья",
        "Ольга", "Юлия", "Татьяна", "Ирина", "Светлана", "Марина", "Надежда", "Любовь", "Мирослава", "Евгения",
        "Ангелина", "Диана", "Алина", "Полина", "Виолетта", "Валерия", "Кира", "Мехриниссо", "Дамира", "Русана",
        "Карина", "Лика", "Маргарита", "Кристина", "Радмила", "Энерел", "Арина", "Лидия", "Алла", "Вероника",
        "Сабина", "Самира", "Сайын-Кыс", "Яна", "Камила", "Лилия", "Ксения", "Милена", "Динара", "Элеонора", "Алсу",
        "Варвара", "Мария", "Милослава", "Аясмаа", "Айсана", "Алёна", "Оксана", "Наджиба", "Лейла", "Зинаида", "Сауле",
        "Эвелина", "Сафина", "Милиса", "Валентина", "Олеся", "Таисия", "Ульяна", "Махаббат", "Сабрина", "Веста",
        "Мадина", "Дана", "Лаура", "Илона", "Лианна", "Лия", "Злата", "Камиля", "Серафима", "Анжелика", "Мариям",
        "Регина", "Альбина", "Даяна", "Наргиза", "Эльнара", "Нелли", "Белла", "Анфиса", "Жанель", "Аэлита", "Инга",
        "Жайнур", "Жанеля", "Айлан", "Доминика", "Нармина", "Альфина", "Дильназ", "Элизана", "Ариана", "Диляра",
        "Каролина", "Замира", "Айслу", "Нина", "Ника", "Аэрома", "Анжела", "Элина", "Фарида", "Рената", "Зарина",
        "Рузана"
    ]
}

output = {
    "male": [],
    "female": []
}

for item in data["male"]:
    output["male"] =